
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьЭлемента(Объект, Элементы);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РазделитьПоТоварамПриИзменении(Элемент)
	УстановитьВидимостьЭлемента(Объект, Элементы);
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыТоварыУслуги
&НаКлиенте
Процедура ТоварыУслугиКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТоварыУслуги.ТекущиеДанные;
	СуммаПоСтроке(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУслугиЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТоварыУслуги.ТекущиеДанные;
	СуммаПоСтроке(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУслугиПриИзменении(Элемент)
	Если Объект.РазделитьПоТоварам Тогда
		Объект.Сумма = Объект.ТоварыУслуги.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУслугиСуммаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ТоварыУслуги.ТекущиеДанные;
	
	Если СтрокаТЧ.Количество = 0 Тогда
		СтрокаТЧ.Количество = 1;
	КонецЕсли;
	
	СтрокаТЧ.Цена = СтрокаТЧ.Сумма / СтрокаТЧ.Количество;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура СуммаПоСтроке(СтрокаТЧ)
	СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлемента(Объект, Элементы)
	
	Если Объект.РазделитьПоТоварам = Истина Тогда
		Элементы.ТоварыУслуги.Видимость = Истина;
	Иначе
		Элементы.ТоварыУслуги.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
