
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Функция СуммаВРублях(Сумма, Валюта, ДатаКурса) Экспорт
	
	//  Если это рубли, вернуть сумму
	Если Валюта = Справочники.Валюты.РоссийскийРубль Тогда		
		
		Возврат Сумма;
		
	Иначе 
		// Если это не рубли, нужно получить данные о курсе на дату, 
		Отбор = Новый Структура;
		Отбор.Вставить("Валюта", Валюта);
		
		ДанныеКурса = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Отбор);
		
		Если ДанныеКурса.Кратность = 0 Тогда
			ДанныеКурса.Кратность = 1;
		КонецЕсли;	
		// сделать пересчет по курсу и вернуть пересчитанную сумму
		СуммаВРублях = Сумма * ДанныеКурса.Курс / ДанныеКурса.Кратность;
		
		Возврат СуммаВРублях;
				
	КонецЕсли;	
	
КонецФункции

Функция СуммаВВалюте(СуммаВРублях, Валюта, ДатаКурса) Экспорт
	
	//  Если это рубли, вернуть сумму
	Если Валюта = Справочники.Валюты.РоссийскийРубль Тогда		
		Возврат СуммаВРублях;		
	КонецЕсли;
	
	// Если это не рубли, нужно получить данные о курсе на дату, 
	Отбор = Новый Структура;
	Отбор.Вставить("Валюта", Валюта);
	
	ДанныеКурса = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Отбор);
	
	Если ДанныеКурса.Курс = 0 Тогда
		ДанныеКурса.Курс =1;
	КонецЕсли;	
	// сделать пересчет по курсу и вернуть пересчитанную сумму
	СуммаВВалюте = СуммаВРублях * ДанныеКурса.Кратность / ДанныеКурса.Курс;
		
	Возврат СуммаВВалюте;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
