#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	СуммаРублевая = РегистрыСведений.КурсыВалют.СуммаВРублях(Сумма, ВалютаСчета(Счет), Дата);
	
	// регистр Доходы
	Движения.Доходы.Записывать = Истина;
	Движение = Движения.Доходы.Добавить();
	Движение.Период = Дата;
	Движение.СтатьиДохода = СтатьяДохода;
	Движение.Валюта = ВалютаСчета(Счет);
	Движение.Сумма = СуммаРублевая;
	Движение.СуммаВалютная = Сумма;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВалютаСчета(Счет) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичныеСчета.Валюта
		|ИЗ
		|	Справочник.ЛичныеСчета КАК ЛичныеСчета
		|ГДЕ
		|	ЛичныеСчета.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Счет);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Валюта;	
	
КонецФункции


#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
